content/rasam/pepper_rasam.org
#+Title: Simple rasam with home made powder

* 0. Lentil

Cook 1/2 cup of lentil. Preferred one is toor dal.

* 1. Masala

Crush the folowing in a motor pestel.

- 2 tsp black pepper
- 2 tsp cumin
- 6 cloves

* 2. Juice

Mix the following with hand.
- 2 tomatoes cubed
- 1 cup tamarind extract
- 2 chlli


* 3. Tadka (tempring)

- 1 tsp mustard
- 1 tsp cumin
- Few red chili
- Few Curry leaves

* Prep

1. Make tadka
2. Tomato tamrind mixture
3. Salt + turmeric and boil of *10 minutes*.
4. Add 4 cups of water and bring to boil.
5. Add 1 cup of cooked lentil and bring to boil.
6. Add the masala paste, mix well and bring to boil.
7. Add kasurin methi.
