rasam/pepper_rasam.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Simple rasam with home made powder</title>
<meta name="generator" content="Org mode" />
<link rel="stylesheet" href="https://cdn.simplecss.org/simple.min.css" />
</head>
<body>
<div id="content">
<h1 class="title">Simple rasam with home made powder</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org12b531a">0. Lentil</a></li>
<li><a href="#orgd7dd797">1. Masala</a></li>
<li><a href="#org1359c5b">2. Juice</a></li>
<li><a href="#orgb3271a5">3. Tadka (tempring)</a></li>
<li><a href="#org33f36b2">Prep</a></li>
</ul>
</div>
</div>

<div id="outline-container-org12b531a" class="outline-2">
<h2 id="org12b531a">0. Lentil</h2>
<div class="outline-text-2" id="text-org12b531a">
<p>
Cook 1/2 cup of lentil. Preferred one is toor dal.
</p>
</div>
</div>

<div id="outline-container-orgd7dd797" class="outline-2">
<h2 id="orgd7dd797">1. Masala</h2>
<div class="outline-text-2" id="text-orgd7dd797">
<p>
Crush the folowing in a motor pestel.
</p>

<ul class="org-ul">
<li>2 tsp black pepper</li>
<li>2 tsp cumin</li>
<li>6 cloves</li>
</ul>
</div>
</div>

<div id="outline-container-org1359c5b" class="outline-2">
<h2 id="org1359c5b">2. Juice</h2>
<div class="outline-text-2" id="text-org1359c5b">
<p>
Mix the following with hand.
</p>
<ul class="org-ul">
<li>2 tomatoes cubed</li>
<li>1 cup tamarind extract</li>
<li>2 chlli</li>
</ul>
</div>
</div>


<div id="outline-container-orgb3271a5" class="outline-2">
<h2 id="orgb3271a5">3. Tadka (tempring)</h2>
<div class="outline-text-2" id="text-orgb3271a5">
<ul class="org-ul">
<li>1 tsp mustard</li>
<li>1 tsp cumin</li>
<li>Few red chili</li>
<li>Few Curry leaves</li>
</ul>
</div>
</div>

<div id="outline-container-org33f36b2" class="outline-2">
<h2 id="org33f36b2">Prep</h2>
<div class="outline-text-2" id="text-org33f36b2">
<ol class="org-ol">
<li>Make tadka</li>
<li>Tomato tamrind mixture</li>
<li>Salt + turmeric and boil of <b>10 minutes</b>.</li>
<li>Add 4 cups of water and bring to boil.</li>
<li>Add 1 cup of cooked lentil and bring to boil.</li>
<li>Add the masala paste, mix well and bring to boil.</li>
<li>Add kasurin methi.</li>
</ol>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="creator"><a href="https://www.gnu.org/software/emacs/">Emacs</a> 27.1 (<a href="https://orgmode.org">Org</a> mode 9.3)</p>
</div>
</body>
</html>
